tylertms/dspic33e-sim/conformance/i2c.c
#include <inttypes.h>
#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>

#include "device.h"
#include "dspic33.h"

typedef struct {
    uint32_t cases;
    uint32_t passed;
    uint32_t failed;
} I2cConformance;

static const uint16_t bases[DSPIC33_I2C_COUNT] = {0x0200u, 0x0210u};
static const uint8_t slave_irqs[DSPIC33_I2C_COUNT] = {16u, 49u};
static const uint8_t master_irqs[DSPIC33_I2C_COUNT] = {17u, 50u};

static void expect(I2cConformance* state, bool condition, const char* name) {
    state->cases++;
    if (condition) {
        state->passed++;
    } else {
        state->failed++;
        printf("[i2c-failed] %s\n", name);
    }
}

static bool interrupt_flag(Dspic33* cpu, uint8_t irq) {
    uint16_t address = (uint16_t)(0x0800u + (irq / 16u) * 2u);
    return (dspic33_read_word(cpu, address) & (uint16_t)(1u << (irq % 16u))) != 0u;
}

static void clear_interrupt(Dspic33* cpu, uint8_t irq) {
    uint16_t address = (uint16_t)(0x0800u + (irq / 16u) * 2u);
    dspic33_write_word(
        cpu, address,
        (uint16_t)(dspic33_read_word(cpu, address) & ~(uint16_t)(1u << (irq % 16u))));
}

static uint64_t operation_cycles(uint16_t baud, uint8_t half_periods) {
    return ((uint64_t)(baud + 2u) * half_periods + 1u) / 2u;
}

static uint64_t control_cycles(uint16_t baud) { return operation_cycles(baud, 2u); }

static uint64_t byte_cycles(uint16_t baud) { return operation_cycles(baud, 18u); }

static uint64_t receive_cycles(uint16_t baud) { return operation_cycles(baud, 16u); }

static uint64_t condition_cycles(uint16_t baud) { return operation_cycles(baud, 3u); }

static void configure_dma_channel(Dspic33* cpu, uint8_t channel, uint8_t request,
                                  uint16_t start, uint16_t pad) {
    uint16_t base = (uint16_t)(0x0b00u + channel * 0x10u);
    dspic33_write_word(cpu, base, 0u);
    dspic33_write_word(cpu, (uint16_t)(base + 2u), request);
    dspic33_write_word(cpu, (uint16_t)(base + 4u), start);
    dspic33_write_word(cpu, (uint16_t)(base + 6u), 0u);
    dspic33_write_word(cpu, (uint16_t)(base + 8u), 0u);
    dspic33_write_word(cpu, (uint16_t)(base + 10u), 0u);
    dspic33_write_word(cpu, (uint16_t)(base + 12u), pad);
    dspic33_write_word(cpu, (uint16_t)(base + 14u), 0u);
    dspic33_write_word(cpu, base, 0x8001u);
}

static void enable(Dspic33* cpu, uint8_t channel, uint16_t options, uint16_t baud) {
    uint16_t base = bases[channel];
    dspic33_write_word(cpu, (uint16_t)(base + 4u), baud);
    dspic33_write_word(cpu, (uint16_t)(base + 6u), (uint16_t)(0x9000u | options));
}

static void register_cases(I2cConformance* state, Dspic33* cpu) {
    uint8_t channel;
    dspic33_reset(cpu, 0u);
    for (channel = 0u; channel < DSPIC33_I2C_COUNT; channel++) {
        uint16_t base = bases[channel];
        expect(state, dspic33_read_word(cpu, base) == 0u, "receive reset");
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 2u)) == 0u,
               "transmit reads zero");
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 4u)) == 0u,
               "baud reset");
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 6u)) == 0x1000u,
               "control reset");
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 8u)) == 0u,
               "status reset");
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 10u)) == 0u,
               "address reset");
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 12u)) == 0u,
               "mask reset");
        dspic33_write_word(cpu, base, 0xffffu);
        expect(state, dspic33_read_word(cpu, base) == 0u, "receive read only");
        dspic33_write_word(cpu, (uint16_t)(base + 4u), 0xffffu);
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 4u)) == 0x01ffu,
               "baud mask");
        dspic33_write_word(cpu, (uint16_t)(base + 6u), 0xbfe0u);
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 6u)) == 0xbfe0u,
               "control mask");
        dspic33_write_word(cpu, (uint16_t)(base + 8u), 0xffffu);
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 8u)) == 0u,
               "status clear-only mask");
        dspic33_write_word(cpu, (uint16_t)(base + 10u), 0xffffu);
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 10u)) == 0x03ffu,
               "address mask");
        dspic33_write_word(cpu, (uint16_t)(base + 12u), 0xffffu);
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 12u)) == 0x03ffu,
               "slave mask mask");
    }
}

static void timing_cases(I2cConformance* state, Dspic33* cpu) {
    static const uint16_t baud_values[] = {2u, 3u, 17u, 0x01ffu};
    uint8_t channel;
    size_t index;
    for (channel = 0u; channel < DSPIC33_I2C_COUNT; channel++) {
        for (index = 0u; index < sizeof(baud_values) / sizeof(baud_values[0]);
             index++) {
            uint16_t base = bases[channel];
            uint16_t baud = baud_values[index];
            uint64_t cycles = control_cycles(baud);
            Dspic33I2cTransfer transfer;
            dspic33_reset(cpu, 0u);
            enable(cpu, channel, 1u, baud);
            expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 6u)) & 1u) != 0u,
                   "start active at write");
            expect(state, dspic33_device_advance(cpu, cycles - 1u),
                   "start boundary advance");
            expect(state, !interrupt_flag(cpu, master_irqs[channel]),
                   "start not complete early");
            expect(state, dspic33_device_advance(cpu, 1u), "start completion advance");
            expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 6u)) & 1u) == 0u,
                   "start clears request");
            expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 8u) != 0u,
                   "start sets bus state");
            expect(state, interrupt_flag(cpu, master_irqs[channel]), "start interrupt");
            if (channel == 1u) {
                expect(state, !interrupt_flag(cpu, 51u),
                       "second module does not raise timer eight interrupt");
            }
            expect(state,
                   dspic33_i2c_transmit(cpu, channel, &transfer) &&
                       transfer.type == DSPIC33_I2C_START && transfer.master,
                   "start output");
        }
    }
}

static void master_sequence_cases(I2cConformance* state, Dspic33* cpu) {
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_I2C_COUNT; channel++) {
        uint16_t base = bases[channel];
        uint16_t baud = (uint16_t)(3u + channel);
        uint64_t control = control_cycles(baud);
        uint64_t receive = receive_cycles(baud);
        uint64_t condition = condition_cycles(baud);
        uint64_t byte = byte_cycles(baud);
        Dspic33I2cTransfer transfer;
        dspic33_reset(cpu, 0u);
        enable(cpu, channel, 1u, baud);
        expect(state, dspic33_device_advance(cpu, control), "sequence start");
        clear_interrupt(cpu, master_irqs[channel]);
        expect(state, dspic33_i2c_respond(cpu, channel, 0u, true, byte),
               "queue transmit acknowledge");
        dspic33_write_word(cpu, (uint16_t)(base + 2u), 0x01a5u);
        expect(state,
               (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 0x4001u) == 0x4001u,
               "transmit busy flags");
        dspic33_write_word(cpu, (uint16_t)(base + 2u), 0x005au);
        expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 0x0080u) != 0u,
               "transmit write collision");
        expect(state, dspic33_device_advance(cpu, receive),
               "transmit shift completion");
        expect(state,
               (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 0x4001u) == 0x4000u,
               "transmit buffer clears before acknowledge");
        expect(state, dspic33_device_advance(cpu, byte - receive - 1u),
               "transmit boundary advance");
        expect(state, !interrupt_flag(cpu, master_irqs[channel]),
               "transmit not complete early");
        expect(state, dspic33_device_advance(cpu, 1u), "transmit complete");
        expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 0xc001u) == 0u,
               "transmit acknowledged status");
        expect(state, interrupt_flag(cpu, master_irqs[channel]), "transmit interrupt");
        expect(state,
               dspic33_i2c_transmit(cpu, channel, &transfer) &&
                   transfer.type == DSPIC33_I2C_START,
               "sequence start output");
        expect(state,
               dspic33_i2c_transmit(cpu, channel, &transfer) &&
                   transfer.type == DSPIC33_I2C_WRITE && transfer.value == 0xa5u,
               "sequence write output");

        clear_interrupt(cpu, master_irqs[channel]);
        dspic33_write_word(cpu, (uint16_t)(base + 8u), 0u);
        expect(state, dspic33_i2c_respond(cpu, channel, 0x6cu, true, receive),
               "queue receive byte");
        dspic33_write_word(cpu, (uint16_t)(base + 6u), 0x9008u);
        expect(state, dspic33_device_advance(cpu, receive), "receive complete");
        expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 2u) != 0u,
               "receive buffer full");
        expect(state, dspic33_read_word(cpu, base) == 0x006cu, "receive value");
        expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 2u) == 0u,
               "receive read clears full");
        expect(state, interrupt_flag(cpu, master_irqs[channel]), "receive interrupt");
        expect(state,
               dspic33_i2c_transmit(cpu, channel, &transfer) &&
                   transfer.type == DSPIC33_I2C_READ && transfer.value == 0x6cu,
               "receive output");

        clear_interrupt(cpu, master_irqs[channel]);
        dspic33_write_word(cpu, (uint16_t)(base + 6u), 0x9030u);
        expect(state, dspic33_device_advance(cpu, control), "nack complete");
        expect(state, interrupt_flag(cpu, master_irqs[channel]), "nack interrupt");
        expect(state,
               dspic33_i2c_transmit(cpu, channel, &transfer) &&
                   transfer.type == DSPIC33_I2C_ACKNOWLEDGE && !transfer.acknowledge,
               "nack output");

        clear_interrupt(cpu, master_irqs[channel]);
        dspic33_write_word(cpu, (uint16_t)(base + 6u), 0x9002u);
        expect(state, dspic33_device_advance(cpu, condition), "restart complete");
        expect(state,
               dspic33_i2c_transmit(cpu, channel, &transfer) &&
                   transfer.type == DSPIC33_I2C_RESTART,
               "restart output");
        clear_interrupt(cpu, master_irqs[channel]);
        dspic33_write_word(cpu, (uint16_t)(base + 6u), 0x9004u);
        expect(state, dspic33_device_advance(cpu, condition), "stop complete");
        expect(state,
               (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 0x0018u) == 0x0010u,
               "stop bus state");
        expect(state, interrupt_flag(cpu, master_irqs[channel]), "stop interrupt");
        expect(state,
               dspic33_i2c_transmit(cpu, channel, &transfer) &&
                   transfer.type == DSPIC33_I2C_STOP,
               "stop output");
    }
}

static void master_error_cases(I2cConformance* state, Dspic33* cpu) {
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_I2C_COUNT; channel++) {
        uint16_t base = bases[channel];
        uint64_t control = control_cycles(0u);
        uint64_t receive = receive_cycles(0u);
        uint64_t byte = byte_cycles(0u);
        dspic33_reset(cpu, 0u);
        enable(cpu, channel, 1u, 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 2u), 0x44u);
        expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 0x0080u) != 0u,
               "write during start collision");
        expect(state, dspic33_device_advance(cpu, control), "error start complete");
        clear_interrupt(cpu, master_irqs[channel]);
        dspic33_write_word(cpu, (uint16_t)(base + 8u), 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 2u), 0x55u);
        expect(state, dspic33_device_advance(cpu, byte), "unacknowledged complete");
        expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 0x8000u) != 0u,
               "unacknowledged status");
        clear_interrupt(cpu, master_irqs[channel]);
        dspic33_write_word(cpu, (uint16_t)(base + 8u), 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 6u), 0x9008u);
        expect(state, dspic33_device_advance(cpu, receive), "first unread receive");
        clear_interrupt(cpu, master_irqs[channel]);
        dspic33_write_word(cpu, (uint16_t)(base + 6u), 0x9008u);
        expect(state, dspic33_device_advance(cpu, receive), "second unread receive");
        expect(state,
               (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 0x0042u) == 0x0042u,
               "receive overflow preserves full");
        expect(state,
               dspic33_i2c_collision(cpu, channel, 0u) &&
                   dspic33_device_advance(cpu, 0u),
               "collision event");
        expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 0x0400u) != 0u,
               "bus collision status");
        expect(state, interrupt_flag(cpu, master_irqs[channel]),
               "bus collision interrupt");
        dspic33_write_word(cpu, (uint16_t)(base + 8u), 0xffffu);
        expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 0x0400u) != 0u,
               "bus collision not software settable");
        dspic33_write_word(cpu, (uint16_t)(base + 8u), 0u);
        expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 0x0400u) == 0u,
               "bus collision software clear");

        dspic33_reset(cpu, 0u);
        enable(cpu, channel, 1u, 0u);
        expect(state, dspic33_device_advance(cpu, control), "stretch start complete");
        clear_interrupt(cpu, master_irqs[channel]);
        expect(state, dspic33_i2c_respond(cpu, channel, 0u, true, byte + 5u),
               "queue stretched acknowledge");
        dspic33_write_word(cpu, (uint16_t)(base + 2u), 0x61u);
        expect(state, dspic33_device_advance(cpu, byte), "advance to clock stretch");
        expect(state,
               !interrupt_flag(cpu, master_irqs[channel]) &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 0x4000u) != 0u,
               "clock stretch delays completion");
        expect(state, dspic33_device_advance(cpu, 5u), "finish clock stretch");
        expect(state,
               interrupt_flag(cpu, master_irqs[channel]) &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 0xc000u) == 0u,
               "stretched acknowledge completes");

        dspic33_reset(cpu, 0u);
        enable(cpu, channel, 1u, 0u);
        expect(state, dspic33_device_advance(cpu, control), "ordered start complete");
        clear_interrupt(cpu, master_irqs[channel]);
        expect(state,
               dspic33_i2c_respond(cpu, channel, 0x11u, true, 20u) &&
                   dspic33_i2c_respond(cpu, channel, 0x22u, true, 10u),
               "queue responses out of order");
        dspic33_write_word(cpu, (uint16_t)(base + 6u), 0x9008u);
        expect(state, dspic33_device_advance(cpu, receive),
               "ordered first receive complete");
        expect(state, dspic33_read_word(cpu, base) == 0x22u,
               "earliest response selected");
        clear_interrupt(cpu, master_irqs[channel]);
        dspic33_write_word(cpu, (uint16_t)(base + 6u), 0x9008u);
        expect(state, dspic33_device_advance(cpu, receive),
               "ordered second response delay");
        expect(state, dspic33_read_word(cpu, base) == 0x11u, "later response selected");
    }
}

static void slave_receive_cases(I2cConformance* state, Dspic33* cpu) {
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_I2C_COUNT; channel++) {
        uint16_t base = bases[channel];
        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 10u), 0x52u);
        dspic33_write_word(cpu, (uint16_t)(base + 12u), 0x01u);
        enable(cpu, channel, 0x0040u, 0u);
        expect(state, dspic33_i2c_slave_start(cpu, channel, 0x53u, false, false, 3u),
               "schedule masked slave address");
        expect(state, dspic33_device_advance(cpu, 2u), "slave address pre-boundary");
        expect(state, !interrupt_flag(cpu, slave_irqs[channel]),
               "slave address not early");
        expect(state, dspic33_device_advance(cpu, 1u), "slave address complete");
        expect(state, interrupt_flag(cpu, slave_irqs[channel]),
               "slave address interrupt");
        expect(state,
               (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 0x003eu) == 0x000au,
               "slave address status");
        expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 6u)) & 0x1000u) == 0u,
               "slave receive stretch");
        expect(state, dspic33_read_byte(cpu, base) == 0x00a6u,
               "slave address receive value");
        expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 2u) == 0u,
               "byte receive read clears full");
        clear_interrupt(cpu, slave_irqs[channel]);
        expect(state,
               dspic33_i2c_slave_write(cpu, channel, 0x38u, 0u) &&
                   dspic33_device_advance(cpu, 0u),
               "queue data during stretch");
        expect(state, !interrupt_flag(cpu, slave_irqs[channel]),
               "stretch delays slave data");
        dspic33_write_word(cpu, (uint16_t)(base + 6u), 0x9040u);
        expect(state, dspic33_device_advance(cpu, 1u), "slave data receive");
        expect(state, interrupt_flag(cpu, slave_irqs[channel]), "slave data interrupt");
        expect(state,
               (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 0x0022u) == 0x0022u,
               "slave data status");
        expect(state, dspic33_read_word(cpu, base) == 0x0038u, "slave data value");
        clear_interrupt(cpu, slave_irqs[channel]);
        expect(state,
               dspic33_i2c_slave_stop(cpu, channel, 1u) &&
                   dspic33_device_advance(cpu, 1u),
               "slave stop event");
        expect(state,
               (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 0x033cu) == 0x0030u,
               "slave stop status");

        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 10u), 0x52u);
        enable(cpu, channel, 0u, 0u);
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0x51u, false, false, 0u) &&
                   dspic33_device_advance(cpu, 0u),
               "mismatched address event");
        expect(state, !interrupt_flag(cpu, slave_irqs[channel]),
               "mismatched address ignored");
        expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 8u) != 0u,
               "mismatched start detected");
    }
}

