tylertms/dspic33e-sim/conformance/i2c.c
static void slave_transmit_cases(I2cConformance* state, Dspic33* cpu) {
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_I2C_COUNT; channel++) {
        uint16_t base = bases[channel];
        Dspic33I2cTransfer transfer;
        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 10u), 0x31u);
        enable(cpu, channel, 0u, 0u);
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0x31u, true, false, 0u) &&
                   dspic33_device_advance(cpu, 0u),
               "slave read address");
        expect(state,
               (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 0x000eu) == 0x000eu,
               "slave read address status");
        expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 6u)) & 0x1000u) == 0u,
               "slave transmitter automatic stretch");
        dspic33_read_word(cpu, base);
        clear_interrupt(cpu, slave_irqs[channel]);
        dspic33_write_word(cpu, (uint16_t)(base + 2u), 0x7du);
        expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 1u) != 0u,
               "slave transmit full");
        dspic33_write_word(cpu, (uint16_t)(base + 6u), 0x9000u);
        expect(state,
               dspic33_i2c_slave_read(cpu, channel, true, 1u) &&
                   dspic33_device_advance(cpu, 1u),
               "slave transmit acknowledged");
        expect(state, interrupt_flag(cpu, slave_irqs[channel]),
               "slave transmit interrupt");
        expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 6u)) & 0x1000u) == 0u,
               "slave acknowledge stretches next byte");
        expect(state,
               dspic33_i2c_transmit(cpu, channel, &transfer) &&
                   transfer.type == DSPIC33_I2C_WRITE && transfer.value == 0x7du &&
                   transfer.acknowledge && !transfer.master,
               "slave transmit output");
        clear_interrupt(cpu, slave_irqs[channel]);
        dspic33_write_word(cpu, (uint16_t)(base + 2u), 0x82u);
        dspic33_write_word(cpu, (uint16_t)(base + 6u), 0x9000u);
        expect(state,
               dspic33_i2c_slave_read(cpu, channel, false, 1u) &&
                   dspic33_device_advance(cpu, 1u),
               "slave transmit not acknowledged");
        expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 0x8000u) != 0u,
               "slave nack status");
        expect(state,
               dspic33_i2c_transmit(cpu, channel, &transfer) &&
                   transfer.value == 0x82u && !transfer.acknowledge,
               "slave nack output");
        expect(state, interrupt_flag(cpu, slave_irqs[channel]),
               "slave nack interrupts");
        expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 6u)) & 0x1000u) != 0u,
               "slave nack does not stretch");

        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 10u), 0x31u);
        enable(cpu, channel, 0u, 0u);
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0x31u, true, false, 0u) &&
                   dspic33_device_advance(cpu, 0u),
               "slave stop read address");
        dspic33_read_word(cpu, base);
        clear_interrupt(cpu, slave_irqs[channel]);
        dspic33_write_word(cpu, (uint16_t)(base + 2u), 0x49u);
        dspic33_write_word(cpu, (uint16_t)(base + 6u), 0x9000u);
        expect(state,
               dspic33_i2c_slave_read(cpu, channel, true, 1u) &&
                   dspic33_device_advance(cpu, 1u),
               "slave stop read data");
        expect(state,
               dspic33_i2c_slave_stop(cpu, channel, 1u) &&
                   dspic33_device_advance(cpu, 1u),
               "slave stop read event");
        expect(state,
               (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 0x033cu) == 0x0034u,
               "slave stop preserves read and data status");
    }
}

static void address_mode_cases(I2cConformance* state, Dspic33* cpu) {
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_I2C_COUNT; channel++) {
        uint16_t base = bases[channel];
        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 10u), 0x02abu);
        enable(cpu, channel, 0x0440u, 0u);
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0x02abu, false, true, 0u) &&
                   dspic33_device_advance(cpu, 0u),
               "ten bit first address event");
        expect(state, interrupt_flag(cpu, slave_irqs[channel]),
               "ten bit first address interrupt");
        expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 0x0100u) == 0u,
               "ten bit first address status");
        expect(state, dspic33_read_word(cpu, base) == 0x00f4u,
               "ten bit first address receive");
        expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 6u)) & 0x1000u) == 0u,
               "ten bit first address stretches");
        dspic33_write_word(cpu, (uint16_t)(base + 6u), 0x9440u);
        expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 6u)) & 0x1000u) != 0u,
               "ten bit second address clock released");
        clear_interrupt(cpu, slave_irqs[channel]);
        expect(state, dspic33_device_advance(cpu, 1u), "ten bit second address event");
        expect(state, interrupt_flag(cpu, slave_irqs[channel]),
               "ten bit second address interrupt");
        expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 0x0100u) != 0u,
               "ten bit second address status");
        expect(state, dspic33_read_word(cpu, base) == 0x00abu,
               "ten bit second address receive");
        expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 6u)) & 0x1000u) == 0u,
               "ten bit second address stretches");
        dspic33_write_word(cpu, (uint16_t)(base + 6u), 0x9440u);
        clear_interrupt(cpu, slave_irqs[channel]);
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0x02abu, true, true, 0u) &&
                   dspic33_device_advance(cpu, 0u),
               "ten bit repeated read event");
        expect(state, interrupt_flag(cpu, slave_irqs[channel]),
               "ten bit repeated read interrupt");
        expect(state,
               (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 0x010cu) == 0x010cu,
               "ten bit repeated read status");
        expect(state, dspic33_read_word(cpu, base) == 0x00f5u,
               "ten bit repeated read receive");
        clear_interrupt(cpu, slave_irqs[channel]);
        dspic33_write_word(cpu, (uint16_t)(base + 2u), 0x63u);
        dspic33_write_word(cpu, (uint16_t)(base + 6u), 0x9400u);
        expect(state,
               dspic33_i2c_slave_read(cpu, channel, false, 1u) &&
                   dspic33_device_advance(cpu, 1u),
               "ten bit slave nack event");
        expect(state,
               !interrupt_flag(cpu, slave_irqs[channel]) &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 0x8000u) != 0u,
               "ten bit slave nack omits interrupt");

        dspic33_reset(cpu, 0u);
        enable(cpu, channel, 0x0080u, 0u);
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0u, false, false, 0u) &&
                   dspic33_device_advance(cpu, 0u),
               "general call event");
        expect(state, interrupt_flag(cpu, slave_irqs[channel]),
               "general call interrupt");
        expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 0x0200u) != 0u,
               "general call status");

        dspic33_reset(cpu, 0u);
        enable(cpu, channel, 0x0800u, 0u);
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0x67u, false, false, 0u) &&
                   dspic33_device_advance(cpu, 0u),
               "ipmi address event");
        expect(state, interrupt_flag(cpu, slave_irqs[channel]),
               "ipmi accepts all addresses");

        dspic33_reset(cpu, 0u);
        enable(cpu, channel, 0x0800u, 0u);
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0x02abu, false, true, 0u) &&
                   dspic33_device_advance(cpu, 0u),
               "ipmi ten bit preamble event");
        expect(state, interrupt_flag(cpu, slave_irqs[channel]),
               "ipmi accepts ten bit preamble");
        dspic33_read_word(cpu, base);
        clear_interrupt(cpu, slave_irqs[channel]);
        expect(state, dspic33_device_advance(cpu, 1u), "ipmi ten bit address event");
        dspic33_read_word(cpu, base);
        clear_interrupt(cpu, slave_irqs[channel]);
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0x02abu, true, true, 0u) &&
                   dspic33_device_advance(cpu, 0u),
               "ipmi ten bit read event");
        expect(state,
               interrupt_flag(cpu, slave_irqs[channel]) &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 4u) != 0u &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 6u)) & 0x1000u) != 0u,
               "ipmi ten bit read aborts without stretching");

        dspic33_reset(cpu, 0u);
        enable(cpu, channel, 0x0800u, 0u);
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0x67u, true, false, 0u) &&
                   dspic33_device_advance(cpu, 0u),
               "ipmi read address event");
        expect(state,
               interrupt_flag(cpu, slave_irqs[channel]) &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 6u)) & 0x1000u) != 0u,
               "ipmi read interrupts without stretching");
        dspic33_read_word(cpu, base);
        clear_interrupt(cpu, slave_irqs[channel]);
        expect(state,
               dspic33_i2c_slave_write(cpu, channel, 0x44u, 0u) &&
                   dspic33_device_advance(cpu, 0u) &&
                   !interrupt_flag(cpu, slave_irqs[channel]),
               "ipmi read aborts slave transfer");
    }
}

static void address_rejection_cases(I2cConformance* state, Dspic33* cpu) {
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_I2C_COUNT; channel++) {
        uint16_t base = bases[channel];
        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 10u), 0x52u);
        enable(cpu, channel, 0u, 0u);
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0x51u, false, false, 0u) &&
                   dspic33_device_advance(cpu, 0u),
               "reject seven bit mismatch");
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0x52u, false, false, 0u) &&
                   dspic33_device_advance(cpu, 0u) &&
                   !interrupt_flag(cpu, slave_irqs[channel]),
               "ignore seven bit restart after mismatch");
        expect(state,
               dspic33_i2c_slave_stop(cpu, channel, 0u) &&
                   dspic33_device_advance(cpu, 0u) &&
                   dspic33_i2c_slave_start(cpu, channel, 0x52u, false, false, 0u) &&
                   dspic33_device_advance(cpu, 0u) &&
                   interrupt_flag(cpu, slave_irqs[channel]) &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 6u)) & 0x1000u) != 0u,
               "seven bit stop restores matching");

        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 10u), 0x02abu);
        enable(cpu, channel, 0x0400u, 0u);
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0x01abu, false, true, 0u) &&
                   dspic33_device_advance(cpu, 0u),
               "reject ten bit high mismatch");
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0x02abu, false, true, 0u) &&
                   dspic33_device_advance(cpu, 0u) &&
                   !interrupt_flag(cpu, slave_irqs[channel]),
               "ignore ten bit restart after high mismatch");
        expect(state,
               dspic33_i2c_slave_stop(cpu, channel, 0u) &&
                   dspic33_device_advance(cpu, 0u) &&
                   dspic33_i2c_slave_start(cpu, channel, 0x02abu, false, true, 0u) &&
                   dspic33_device_advance(cpu, 0u) &&
                   interrupt_flag(cpu, slave_irqs[channel]),
               "ten bit stop restores high matching");

        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 10u), 0x02abu);
        enable(cpu, channel, 0x0400u, 0u);
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0x02acu, false, true, 0u) &&
                   dspic33_device_advance(cpu, 1u),
               "reject ten bit low mismatch");
        clear_interrupt(cpu, slave_irqs[channel]);
        expect(state,
               dspic33_i2c_slave_start(cpu, channel, 0x02abu, false, true, 0u) &&
                   dspic33_device_advance(cpu, 0u) &&
                   !interrupt_flag(cpu, slave_irqs[channel]),
               "ignore ten bit restart after low mismatch");
        expect(state,
               dspic33_i2c_slave_stop(cpu, channel, 0u) &&
                   dspic33_device_advance(cpu, 0u) &&
                   dspic33_i2c_slave_start(cpu, channel, 0x02abu, false, true, 0u) &&
                   dspic33_device_advance(cpu, 0u) &&
                   interrupt_flag(cpu, slave_irqs[channel]),
               "ten bit stop restores low matching");
    }
}

static void isolation_and_power_cases(I2cConformance* state, Dspic33* cpu) {
    Dspic33I2cTransfer transfer;
    dspic33_reset(cpu, 0u);
    enable(cpu, 0u, 1u, 0u);
    enable(cpu, 1u, 1u, 9u);
    expect(state, dspic33_device_advance(cpu, control_cycles(0u)),
           "first channel independent completion");
    expect(state,
           interrupt_flag(cpu, master_irqs[0]) && !interrupt_flag(cpu, master_irqs[1]),
           "first channel independent interrupt");
    expect(state, dspic33_device_advance(cpu, control_cycles(9u) - control_cycles(0u)),
           "second channel independent completion");
    expect(state, interrupt_flag(cpu, master_irqs[1]),
           "second channel independent interrupt");
    expect(state,
           dspic33_i2c_transmit(cpu, 0u, &transfer) &&
               transfer.type == DSPIC33_I2C_START,
           "first channel independent output");
    expect(state,
           dspic33_i2c_transmit(cpu, 1u, &transfer) &&
               transfer.type == DSPIC33_I2C_START,
           "second channel independent output");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x0760u, 0x0080u);
    dspic33_write_word(cpu, 0x0206u, 0x8001u);
    expect(state, dspic33_read_word(cpu, 0x0206u) == 0x1000u,
           "disabled first module ignores writes");
    dspic33_write_word(cpu, 0x0764u, 0x0002u);
    dspic33_write_word(cpu, 0x0216u, 0x8001u);
    expect(state, dspic33_read_word(cpu, 0x0216u) == 0x1000u,
           "disabled second module ignores writes");

    dspic33_reset(cpu, 0u);
    enable(cpu, 0u, 0u, 0u);
    dspic33_write_word(cpu, 0x0206u, 0x8000u);
    expect(state, dspic33_read_word(cpu, 0x0206u) == 0x9000u,
           "software cannot clear release without stretch enable");
    dspic33_write_word(cpu, 0x0206u, 0x8040u);
    expect(state, dspic33_read_word(cpu, 0x0206u) == 0x8040u,
           "software clears release with stretch enable");
    dspic33_write_word(cpu, 0x0206u, 0u);
    expect(state, dspic33_read_word(cpu, 0x0206u) == 0x1000u,
           "module disable releases clock");
    enable(cpu, 0u, 0u, 0u);
    dspic33_write_byte(cpu, 0x0203u, 0x5au);
    expect(state, (dspic33_read_word(cpu, 0x0208u) & 0x4001u) == 0u,
           "transmit high byte ignored");
    dspic33_write_byte(cpu, 0x0202u, 0x5au);
    expect(state, (dspic33_read_word(cpu, 0x0208u) & 0x4001u) == 0x4001u,
           "transmit low byte starts transfer");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x0206u, 0xb001u);
    cpu->power_state = DSPIC33_POWER_IDLE;
    expect(state, dspic33_device_advance(cpu, control_cycles(0u)), "idle stop advance");
    expect(state,
           (dspic33_read_word(cpu, 0x0206u) & 1u) != 0u &&
               !interrupt_flag(cpu, master_irqs[0]),
           "idle stop freezes module");
    cpu->power_state = DSPIC33_POWER_ACTIVE;
    expect(state, dspic33_device_advance(cpu, 1u), "idle resume advance");
    expect(state,
           (dspic33_read_word(cpu, 0x0206u) & 1u) == 0u &&
               interrupt_flag(cpu, master_irqs[0]),
           "idle resume completes module");

    dspic33_reset(cpu, 0u);
    enable(cpu, 0u, 1u, 0u);
    dspic33_write_word(cpu, 0x0760u, 0x0080u);
    expect(state, dspic33_device_advance(cpu, control_cycles(0u)),
           "power disable advance");
    expect(state, !interrupt_flag(cpu, master_irqs[0]),
           "power disable blocks pending completion");

    dspic33_reset(cpu, 0u);
    enable(cpu, 0u, 1u, 0x01ffu);
    dspic33_reset(cpu, 0u);
    expect(state, dspic33_device_advance(cpu, control_cycles(0x01ffu)),
           "reset canceled operation advance");
    expect(state, !interrupt_flag(cpu, master_irqs[0]),
           "reset cancels pending operation");
    expect(state, !dspic33_i2c_transmit(cpu, 0u, &transfer),
           "reset clears output queue");
}

static void disable_cases(I2cConformance* state, Dspic33* cpu) {
    static const uint16_t requests[] = {1u, 2u, 4u, 8u, 16u};
    uint8_t channel;
    size_t index;
    for (channel = 0u; channel < DSPIC33_I2C_COUNT; channel++) {
        uint16_t base = bases[channel];
        for (index = 0u; index < sizeof(requests) / sizeof(requests[0]); index++) {
            dspic33_reset(cpu, 0u);
            enable(cpu, channel, requests[index], 2u);
            expect(state,
                   (dspic33_read_word(cpu, (uint16_t)(base + 6u)) & requests[index]) !=
                       0u,
                   "disable request active");
            dspic33_write_word(cpu, (uint16_t)(base + 6u), 0u);
            expect(state, dspic33_read_word(cpu, (uint16_t)(base + 6u)) == 0x1000u,
                   "disable clears request and releases clock");
            expect(state, dspic33_read_word(cpu, (uint16_t)(base + 8u)) == 0u,
                   "disable clears status");
            expect(state, dspic33_device_advance(cpu, receive_cycles(2u)),
                   "disabled request canceled advance");
            expect(state, !interrupt_flag(cpu, master_irqs[channel]),
                   "disabled request canceled interrupt");
            enable(cpu, channel, 1u, 2u);
            expect(state, dspic33_device_advance(cpu, control_cycles(2u)),
                   "disable clean re-enable advance");
            expect(state,
                   (dspic33_read_word(cpu, (uint16_t)(base + 6u)) & 1u) == 0u &&
                       interrupt_flag(cpu, master_irqs[channel]),
                   "disable clean re-enable completion");
        }

        dspic33_reset(cpu, 0u);
        enable(cpu, channel, 0u, 2u);
        dspic33_write_word(cpu, (uint16_t)(base + 2u), 0x5au);
        expect(state,
               (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 0x4001u) == 0x4001u,
               "disable transmit active");
        dspic33_write_word(cpu, (uint16_t)(base + 6u), 0u);
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 6u)) == 0x1000u,
               "disable transmit releases clock");
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 8u)) == 0u,
               "disable transmit clears status");
        expect(state, dspic33_device_advance(cpu, byte_cycles(2u)),
               "disabled transmit canceled advance");
        expect(state, !interrupt_flag(cpu, master_irqs[channel]),
               "disabled transmit canceled interrupt");
        enable(cpu, channel, 1u, 2u);
        expect(state, dspic33_device_advance(cpu, control_cycles(2u)),
               "disable transmit clean re-enable advance");
        expect(state,
               (dspic33_read_word(cpu, (uint16_t)(base + 6u)) & 1u) == 0u &&
                   interrupt_flag(cpu, master_irqs[channel]),
               "disable transmit clean re-enable completion");
    }
}

